<template>
    <scroller>
        <div>
            <image :style="{ width: img_w, height:img_1_h }"
                   src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505385894826&di=60715b2f5361f2fde57deb7e04bbbf30&imgtype=0&src=http%3A%2F%2Fnewsimg.zhixiaoren.com%2F18%2F60%2F060055768qeo3ka6bdfmdjfhgqb1b3fgmolqmpk.jpg"></image>
            <div :style="{ marginLeft: contentMargin,marginRight: contentMargin}">
                <text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"
                      style="color: #334f16;">{{title}}
                </text>
                <image :style="{ width: img_w, height:img_1_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505386114032&di=7931c8898df98c1b2d97d092986943c8&imgtype=0&src=http%3A%2F%2Fimg.mp.itc.cn%2Fupload%2F20160918%2F02e724d4b0ae476db67e199cc3d5e52c_th.jpeg"></image>
                <image :style="{ width: img_w, height:img_1_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505386122007&di=c99427f21ecc24dfde37f022f2c2c1dd&imgtype=0&src=http%3A%2F%2Fimg.mp.itc.cn%2Fupload%2F20160918%2F39fd5d79d6944ed182292c0146a57753_th.jpeg"></image>
                <image :style="{ width: img_w, height:img_1_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505386140738&di=21122db506cc9b2f2b76007d7ed55c38&imgtype=0&src=http%3A%2F%2Fimg.mp.itc.cn%2Fupload%2F20160918%2F6085fe4118734af5986bf5975a35796b_th.jpeg"></image>
                <image :style="{ width: img_w, height:img_1_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505386149799&di=8f8155b7b36aae56984118bd2c6094d1&imgtype=0&src=http%3A%2F%2Fimg.mp.itc.cn%2Fupload%2F20160918%2Ff0bd81d5f03c4ab893660fdfeee64b3c_th.jpeg"></image>
                <image :style="{ width: img_w, height:img_1_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505386151727&di=f8e8e0a2eb196cc77e1f5184cffa23ae&imgtype=0&src=http%3A%2F%2Fimg.mp.itc.cn%2Fupload%2F20160918%2F7c6159de25e843359da42f5abfcc66b5_th.jpeg"></image>
                <text :style="{ fontSize: tex_size_2 ,marginTop:contentMargin}"> 事件背景 </text>
                <text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"
                      style="color: #334f16;">{{content_1}}
                </text>
                <image :style="{ width: img_w, height:img_2_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505389252801&di=f8a375f2d623bc80d84932ec5118d4a7&imgtype=0&src=http%3A%2F%2Fimg.ishuo.cn%2F1607%2F1468555231.jpg"></image>
                <text :style="{ fontSize: tex_size_2}" style="margin-top: 15px"> 事件经过 </text>
                <text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"
                      style="color: #334f16;">{{content_2}}
                </text>
                <image :style="{ width: img_w, height:img_3_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505389516486&di=c7ba092d375b7e81692e670408d19e8b&imgtype=0&src=http%3A%2F%2Fs15.sinaimg.cn%2Fmw690%2F00618XTWzy74WcCT2DI4e%26690"></image>
                <text :style="{ fontSize: tex_size_2}" style="margin-top: 15px"> 历史影响 </text>
                <text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"
                      style="color: #334f16;">{{content_3}}
                </text>
                <image :style="{ width: img_w, height:img_4_h }"
                       src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1505389663560&di=c66797a86e3d88db013432d069e45d12&imgtype=0&src=http%3A%2F%2Ftc.sinaimg.cn%2Fmaxwidth.2048%2Ftc.service.weibo.com%2Fp%2Fmmbiz_qlogo_cn%2F0b90e7618847be349d6dfddb23087576.jpg"></image>
                <text :style="{ fontSize: tex_size_2}" style="margin-top: 15px"> 后世纪念 </text>
                <text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"
                      style="color: #334f16;">{{content_4}}
                </text>
                <image :style="{ width: img_w, height:img_5_h }"
                       src=""></image>
                <!--<text :style="{ fontSize: tex_size_2}" style="margin-top: 15px"></text>-->
                <!--<text :style="{ fontSize: tex_size_1,marginTop: topMargin, margin:contentMargin,lineHeight:line_height}"-->
                      <!--style="color: #334f16;">{{content_5}}</text>-->
            </div>
        </div>
    </scroller>

</template>

<script>
  //  var buiweex = require("bui-weex");
  var modal = weex.requireModule('modal');
  export default {
    props: {
      img_w: {
        default: 750
      },
      img_1_h: {
        default: 423
      },
      img_2_h: {
        default: 468
      },

      img_3_h: {
        default: 459
      },

      img_4_h: {
        default: 414
      },
      img_5_h: {
        default: 0
      },
      contentMargin: {
        default: 16
      },
      tex_size_1: {
        default: 30
      },
      tex_size_2: {
        default: 35
      },
      topMargin: {
        default: 40
      },
      line_height: {
        default: 55
      },
      title: {
        default: "        九一八事变（又称奉天事变、柳条湖事件）是日本在中国东北蓄意制造并发动的一场侵华战争，是日本帝国主义侵华的开端。\n" +
        "        1931年9月18日夜，在日本关东军安排下，铁道“守备队”炸毁沈阳柳条湖附近日本修筑的南满铁路路轨，并栽赃嫁祸于中国军队。日军以此为借口，炮轰沈阳北大营，是为“九一八事变”。次日，日军侵占沈阳，又陆续侵占了东北三省。1932年2月，东北全境沦陷。此后，日本在中国东北建立了伪满洲国傀儡政权，开始了对东北人民长达14年之久的奴役和殖民统治。\n" +
        "        “九一八事变”是日本帝国主义长期以来推行对华侵略扩张政策的必然的结果，也是企图把中国变为其独占的殖民地而采取的重要步骤。它同时标志着世界反法西斯战争的开始，揭开了第二次世界大战东方战场的序幕。"
      },
      content_1: {
        default: "时代背景\n" +
        "        一战后，日本在华扩张受到了英美列强的遏制，中国的北伐战争使日本在华利益受到削弱，促使日本政府调整对华政策，加快吞并中国东北地区的步伐；20世纪30年代初，世界经济危机发生，日本经济遭受沉重打击，陷入极端困境，并导致政治危机，在内外交困情况下，日本法西斯势力决意冲破华盛顿体系对日本的束缚，趁英美忙于应付危机，蒋介石大规模“剿共”之际，夺取东北，以摆脱困境，并图谋争霸世界。\n" +
        "中国背景\n" +
        "     皇姑屯事件\n" +
        "        日军与东北军阀张作霖曾有合作关系，但渐渐的，日本开始将张作霖视为障碍。1928年6月，日本关东军发起皇姑屯事件，将张作霖乘坐的列车炸毁，张作霖重伤不治身亡，日本希望借此事件造成东北出现群龙无首的局面，借机占领东北。\n" +
        "        1928年12月29日凌晨，张学良等冲破日本帝国主义的阻挠，联名通电全国称：“仰承先大元帅遗志，力谋统一，贯彻和平。已于即日起，宣布遵守三民主义，服从国民政府，改易旗帜。’’是日起，东三省一律改悬南京国民政府的青天白日旗，是为东北易帜。至此，北洋军阀在中国的统治历史宣告结束。国民党政府形式上“统一”全国。 \n" +
        "        张学良进一步对日本采取不合作的态度，并开始在南满洲铁路附近建设新的铁路设施，通过低廉的价格与之竞争，导致南满洲铁路陷入了经营危机。感到危机感的关东军不断提出抗议，但张学良并不愿意妥协。因此日军石原莞尔、板垣征四郎等人决定发动战争来夺得主导权。\n" +
        "     中东路事件\n" +
        "        1929年6月15日至20日，辽、吉、黑、热四省及哈尔滨特区军政大员齐集沈阳，参加张作霖逝世一周年纪念会，并讨论中东路等有关问题。7月7日，张学良赴北平与蒋介石晤谈；10日，南京政府外长王正廷亦被召至北平；同日，张学良贸然派军占领“中东路”，并将苏联的商船贸易公司、国家贸易公司等驻华机构同时查封，搜查苏联职员，逮捕200余人，此为“中东路事件” \n" +
        "        7月13日，苏联政府照会中国政府表示强烈抗议，并限期答复举行和谈的建议；7月16日，南京国民政府外交部复照苏联外交部；苏方认为不能满意，于7月17日向南京国民政府宣布断绝外交关系；7月19日，南京国民政府外交部就中苏绝交问题发表对外宣言；7月20日，国民政府主席蒋介石为苏联事发表《告全国将士》电和《告东北将士》书；7月23日，国民政府关闭驻苏使馆。 \n" +
        "        至此，中苏邦交完全断绝。苏联在中国的权益暂时委托德国代办负责。\n" +
        "     国共对峙\n" +
        "        1927年国共关系破裂后，国民党虽然逐步统一于南京国民政府的旗帜下，但是其内部派系林立，纷争不断，国民政府对南方各省的统治力度薄弱。自1927年秋至1930年夏，中共先后组织了南昌起义、秋收起义、广州起义、年关暴动、平江起义、百色起义等上百次起义和暴动，先后创建井冈山、赣南闽西、湘鄂西、鄂豫皖边、湘鄂赣边等十多块革命根据地，发展武装十多个军、7万多人，并多次击败国军一省或多省联合的进剿和会剿。\n" +
        "        中原大战结束后，蒋介石于1930年10月、1931年4月，先后两次对中共领导的中央苏区进行两次大规模围剿（使用均为杂牌部队），均告失败。\n" +
        "        1931年7月，蒋介石再次集中包括部分嫡系在内的30万军队，发动对中央苏区的第三次围剿。进剿初期，国军进展顺利；8月上旬，红军抓住战机，接连在莲塘、良村和黄陂重创上官云相第47师和郝梦龄第54师，一度取得主动地位，但旋即红军主力即于1931年8月16日陷入国军重围；随后因国民党内部宁粤冲突，国军围剿部队被迫做战略收缩；红军抓住时机，于1931年9月7日—15日间，重创蒋鼎文第9师、韩德勤第52师于白石、张家背一带。第三次围剿，国军基本上能控制战场局面，虽有损失，也不足以影响全局。而红军在国民党大军的“围追堵截”下，却显得极为被动，甚至接连受到挫折。\n" +
        "     国内混战\n" +
        "        1930年3月，为争夺中央统治权，汪精卫联合阎锡山、冯玉祥、李宗仁等地方实力派发起挑战蒋介石南京中央政府及国民党中央会议的内战，5月蒋介石宣布“平叛”，双方激战近半年、伤亡30万人，史称“中原大战”。\n" +
        "        1931年5月底，广州国民政府外交部长陈友仁秘密出访日本，三次会见日本外相币原喜重郎，“表示愿以东北权益博取日本军火”，但未得到响应； 陈友仁在日期间，还会见苏联驻日大使寻求支持，也被拒绝。 \n" +
        "        1931年9月1日广州国民政府进行总动员，出师讨蒋，并在天津设立“北方军事政务委员会”，任命阎锡山、冯玉祥、韩复榘、邹鲁等人为委员，统一北方反蒋武装。\n" +
        "        蒋介石迅速调兵“讨逆”并亲自从南京往南昌督战，至此，国民政府主要军事力量都被吸引在了南方。\n" +
        "     日军挑衅\n" +
        "        1931年，中国人郝永德未经政府批准，骗取万宝山村附近12户农民的土地，并违法转租给188名朝鲜人耕种水稻。这些朝鲜人开掘水渠，截流筑坝，侵害了当地农户的利益，马家哨口200余农民上告。吉林省政府批示：“令朝侨出境”。然而日本驻长春领事田代重德，派遣日本警察制止朝鲜人撤走，且限令于1931年7月5日前完成筑渠。7月1日中国农民愤而填渠毁坝，日本警察以护侨为名开枪打死打伤中国农民数十人，一手制造流血事件。事后，日本歪曲事实真相，在朝鲜各地煽动反华风潮，致使旅朝华侨死伤数百人，财产损失无数。同时日本借机增兵满洲，为武装侵略东北大造舆论。\n" +
        "        1931年6月，日本关东军中村震太郎大尉和曹井杉延太郎在兴安岭索伦一带作军事调查，被中国东北军兴安屯垦公署第三团团副董昆吾发现并扣留，在证据确凿情况下，团长关玉衡下令秘密处决中村震太郎。日本借机宣称东北军士兵因谋财害命而杀死中村，威逼中国交出关玉衡，并在日本民众中煽风点火，用“中村事件”和“万宝山事件”诬陷中国“损害日韩移民”。 \n" +
        "        尽管日本在万宝山事件和中村事件多次挑衅，张学良仍于1931年9月6日致电东北军参谋长荣臻及东北三省政务委员会：“现在日方对我外交渐趋积极，应付一切，极宜力求稳慎，对于日人无论其如何寻事，我方务须万方容忍，不可与之反抗，致酿事端。希迅即密电各属，切实注意为要。”这就是所谓的“鱼电”。\n" +
        "     江淮水灾\n" +
        "        1931年7月28日，长江中下游豪雨成灾，大水席卷江淮流域8省2市，汉口堤防溃堤，直接冲击了南京国民政府的经济和赋税重心，使本已捉襟见肘的南京国民政府财政雪上加霜。大水造成的灾民占全国四分之一人口，损失达20多亿元。国民政府紧急组织“救济水灾委员会”，作为代表政府的最高赈济机构，制定各种应急救灾对策。\n" +
        "        国民政府战争频繁，再加上各项建设事业需费甚多，国库空虚， 严重财政赤字，但仍将全国预算七分之一用于赈灾，使国家赤字愈加增多。国民政府还通过赈灾公债、美麦借款、加征税收、摊派捐款和社会募捐等筹集钱款赈灾，至1931年底共筹集6000余万救灾款。但湖北、安徽、江苏仍爆发骚乱。\n" +
        "     国民党政府的外交\n" +
        "        万宝山事件发生后，蒋介石当即指派宋子文与日本驻华公使重光葵秘密商议。随后，他又抽调具有对日工作经验的驻日内瓦国际联盟代表蒋作宾出任驻日公使，想要以外交途径来消弭东北的危机。\n" +
        "        东北地方当局和国民政府依据蒋介石的对日消极态度错误地采取了不抵抗政策，但蒋本人在事变当天并不知情，因此张学良对失土丧师应负一定的责任。据《顾维钧回忆录》425（也有438页）页记载：“委员长原已发现他的处境非常困难，早在沈阳事件之前的夏天，他就在庐山举行扩大会议，讨论当时提出的提别是少帅在东北的集团提出的对日采取强硬态度，和直接抵抗日本的侵略政策等要求，委员长是个现实主义的政治家，他觉得必须对日谈判。”\n" +
        "        日本关东军不到两万人，中国东北军驻在东北的有16.5万人，在关内还有近十万人。东北军部队多次接受张学良不准抵抗的训令，在日军突然袭击面前，除小部分自发英勇抵抗外，其余均不战而退。1931年9月19日上午8时，日军几乎未受到抵抗便将沈阳全城占领，东北军撤向锦州。此后，东北各地的中国军队或宣布“独立”，或继续执行张学良的不抵抗主义，使日军得以迅速占领辽宁、吉林、黑龙江3省大部分地区。虽有一部分东北军加入了风起云涌的抗日义勇军，但东北寒冷的气候和稀少的村落，抵抗运动很难取得明显效果。\n" +
        "日本方面\n" +
        "     控制东北线路\n" +
        "        1905年，日本在日俄战争中获胜，通过日俄讲和条约，将中国旅顺、大连等地的租借权和“长春－旅顺”一段铁路及附属设施的财产权利占为己有。此后，日本创立“南满洲铁道株式会社”，并由关东军负责铁路沿线的警备。 \n" +
        "     日本国内情况\n" +
        "        明治维新以来，日本奉行军事优先的原则，培养了大批职业军人；而1921年华盛顿会议后，日本开始大规模裁军，1921年至1930年日本的军费由七亿三千万日元裁减到五亿日元以下，裁减额达40%。大规模裁军引起了军人们的强烈不满，不满的军人开始秘密集会，天剑党、樱会、一夕会等以东条英机、冈村宁次、石原莞尔为首的军人秘密组织纷纷成立。 \n" +
        "        1927年6月，日本首相田中义一主持召开“东方会议”，确立了“把满洲从中国本土分裂出来，自成一区，置日本势力之下”的侵略方针；两年后，世界资本主义经济危机波及日本，到1931年，日本陷入极端困难的境地。日本政府急于发动一场对中国的战争，借以转移国内人民的视线，缓和阶级矛盾。 \n" +
        "     田中奏折\n" +
        "        1927年6-7月，日本政府在东京召开“东方会议”，讨论并确定了侵略中国的具体方案，并由田中义一起草了一份秘密奏折给天皇，制定《对华政策纲要》（即田中奏折）。奏折内称“欲征服中国，必先征服满蒙；欲征服世界，必先征服中国”，充分暴露了日本帝国主义的侵略野心。"
      },
      content_2: {
        default: "战争开始\n" +
        "        1931年9月18日傍晚，日本关东军虎石台独立守备队第2营第3连离开原驻地虎石台兵营，沿南满铁路向南行进。夜22时20分左右，日本关东军铁路守备队柳条湖分遣队队长河本末守中尉为首一个小分队以巡视铁路为名，在奉天（现沈阳）北面约7．5公里处，离东北军驻地北大营800米处的柳条湖南满铁路段上引爆小型炸药，炸毁了小段铁路，并将3具身穿东北军士兵服装的中国人尸体放在现场，作为东北军破坏铁路的证据，诬称中国军队破坏铁路并袭击日守各队，此事件由称“九·一八事变”。由于当时中国东北地区称为满洲，因此日本方面将这次事变称为“满洲事变”。\n" +
        "        爆炸同时，呆在铁路爆破点以北约四公里的文官屯的川岛中队长率兵南下，开始袭击北大营；爆炸后，驻扎中方北大营和沈阳城的日军兵分南北两路，向中国军队驻地北大营进攻。\n" +
        "溃不成军\n" +
        "        1931年9月18日事变发生当夜，东北边防军司令长官公署中将参谋长荣臻根据张学良之命，命令东北军“不准抵抗，不准动，把枪放到库房里，挺着死，大家成仁，为国牺牲”。次日1931年9月19日张学良在协和医院对天津大公报记者谈话时再度说：“吾早下令我部士兵，对日兵挑衅,，不得抵抗。故北大营我军，早令收缴军械，存于库房”。由于执行张学良不抵抗命令，北大营8000名守军被只有300左右的日军击溃。 \n" +
        "        日军独立守备队向北大营进攻的同时，关东军第2师第3旅第29团向奉天城攻击，至9月19目10时，日军先后攻占奉天、四平、营口、凤凰城、安东等南满铁路、安奉铁路沿线18座城镇。长春地区的东北军自发反击，战至次日，长春陷落。1931年9月21日，日军第2师主力占领吉林。1931年10月1日，东北军黑龙江洮南镇守使张海鹏投敌，且奉日军命令派出3个团进攻齐齐哈尔。1931年10月26日，关东军第2师第29团占领四洮铁路沿线主要城镇。1931年11月4日，关东军嫩江支队攻击嫩江桥北守军。1931年11月19日，日军攻陷齐齐哈尔。 \n" +
        "锦州撤离\n" +
        "        张学良在事件爆发后离开奉天，带领属下转移到锦州。1931年10月8日，关东军派出12架轰炸机空袭锦州。对此，南次郎陆军大臣依然对若槻礼次郎首相声称“由于受到中国军队的防空炮火攻击，才不得已采取自卫行动”，此后关东军发表公开声明，宣称“张学良在锦州集结大量兵力，如果置之不理，恐将对日本权益造成损害。为了尽快解决满蒙问题，关东军有必要驱逐锦州政权。”此后，币原主张的国际协调主义外交政策受到了严重的挫折，日本越来越强硬。\n" +
        "        黑省沦陷后，南京政府觉察日军将进犯锦州，急令中国驻国联代表施肇基于1931年11月25日向国联提出划锦州为中立区的提议。12月2日，国民党政府就通知英、法、美三国的公使说：它同意把自己的军队撤出锦州和山海关，但是有一个条件，即日本要提出使法、英、美三国满意的保证，即要求三国保证中立区的安全。有了南京政府的表态，张学良急不可待地直接与北平日本公使馆参事就此事进行具体交涉。但这种交涉不仅受到南京方面的反对，而且也无法从日本方面获得妥协的条件，日方坚持东北军必须全数撤出锦州。\n"+
        "        锦州中立案曝光后，遭到各界人士和学生群起反对，国民政府外交部于1931年12月4日被迫急电施肇基声明放弃中立案，同时还表示：日军如进攻锦州，中方将实行自卫。国民党中央政治会议也已就此作出决议，强调“如日军进攻，应积极抵抗”。 \n" +
        "        可对于是否抵抗问题，南京政府与张学良之间明显发生分歧。张明显地倾向于和平方法解决，钟情于“锦州中立化”方案。1931年11月29日，张学良致蒋介石密电，称“惟个人对此（指中立案）亦颇赞成”，并在与日方代表谈判之同时，开始秘密安排从锦州一线自动撤军。此举引起了南京政府的严重不安。顾维钧于1931年12月3日电文中极力劝阻道：“兄（指张学良）拟将锦州驻军自动撤退，请暂从缓”；后1931年12月5日顾维钧又与宋子文联名致电张学良：“现在如日人进兵锦州，兄为国家计，为兄个人计，自当力排困难，期能防御。”蒋介石亦于1931年12月8日致电张学良：“锦州军队此时勿撤退。” 但张学良12月21日致电第二军司令部：“当最近日本进攻锦州之时，我军驻关外部队理应防范，但若现政府方针未定时，自然不用锦州部队进行防守，因而撤至关内”，“部队驻地为迁安、永平、滦河、昌黎”。1931年12月25日、26日，张学良又致电国民政府，称“锦战一开，华北全局必将同时牵动”，届时日本“以海军威胁我后方，并扰乱平津，使我首尾难顾”，非但锦州不可守，连华北地盘亦不保。因此张学良不顾劝告，一意孤行将军队从锦州撤退。\n" +
        "战火蔓延\n" +
        "        而与此同时，1931年12月15日，关东军已经开始进攻锦州。12月7日，日本陆军中央部由日本本土增派混成第8旅，并从朝鲜调第20师司令部、混成第38旅、重轰炸飞行中队以增援关东军。12月28日，第2师主力渡过辽河进攻锦州；12月30日，混成第39旅进攻打虎山（今大虎山）。 \n" +
        "        日军进攻锦州时，国民政府多次电令张学良抵抗，1931年12月25日，令其“积极筹划自卫，以固疆圉”，张不遵令；张学良部队开始从锦州撤退后，12月30日国民政府还急电令其“无论如何，必积极抵抗”，但已经无济于事。1932年1月3日，第20师司令部率混成第38旅占领锦州。而此时驻锦州的东北军第12、第20旅和骑兵第3旅早已奉张学良命撤退至河北滦东地区和热河。在张学良的一再不抵抗下日军兵不血刃占领锦州。\n" +
        "        1932年1月28日关东军第3旅由长春向哈尔滨进军，同时从辽西地区调第2师增援。当时为了转移国际社会对满洲的关注，日本在国际大城市上海挑起事端，引发了一·二八事变。1932年1月31日，依兰镇守使兼第24旅旅长李杜率吉林自卫军进行哈尔滨保卫战。激战五天，自卫军丢盔弃甲，溃不成军，撤往宾县。1932年2月5日日军占领哈尔滨。 \n" +
        "战争结果\n" +
        "        由于张学良一再坚持“不抵抗政策”，在不到半年的时间内，整个东北三省100万平方公里的土地被日军占领，日本对东北三省的大规模侵略强烈地震动了中国社会，一个群众性的抗日救亡运动很快在全国许多城市和村镇兴起。"
      },
      content_3: {
        default: "揭开二战序幕\n" +
        "        九一八事变是20世纪30年代初期发生在中国东北的震惊中外的重大历史事件。它不仅是日本帝国主义以武力征服中国的开始，也是法西斯国家在世界上点燃的第一把侵略战火，它的爆发标志着亚洲战争策源地的形成和第二次世界大战序幕的揭开，同时它打破了第一次世界大战后形成的相对稳定的世界格局。\n" +
        "社会性质转变\n" +
        "        毛泽东曾明确指出：“自从一九三一年九一八事变日本帝国主义武装侵略中国以后，中国又变成了一个殖民地、半殖民地和半封建的社会。”“九一八”事变后，中国东北沦为日本的殖民地，而且日本侵略逐步向华北地区扩展， 中国社会性质发生了变化，中华民族得到了空前的觉醒和团结。 \n" +
        "民族团结抗日\n" +
        "        九一八事变及时向全国人民敲起警钟，“中华民族到了最危险的时候！”越来越成为华夏儿女的共识。在民族危机感逐步加深的过程中，民族责任感也迅速提高，并付诸实践；许多爱国知识分子积极发表政见和主张，呼吁全国人民“彻底明了国难的真相！”“人人应视为与己有切肤之痛，以决死的精神，团结起来作积极的挣扎与苦斗”，广大民众和各界人士以各种形式积极投身抗日救亡运动。\n" +
        "        国共两党是当时中国的两大政党，九一八事变后，随着中华民族的空前觉醒，民族团结也日益增强，两党的民族使命感迅速增强，有力的促进了两党的再次合作，从东北地区到西北地区，最后发展到全中国，终于开创了团结御侮，共同抵抗日本帝国主义的侵略的新局面，实现了民族大团结。"
      },
      content_4: {
        default: "纪念场馆\n" +
        "        1991年9月18日，中国政府在沈阳开放了九·一八历史博物馆。前日本首相桥本龙太郎在1997年访华时拜访过这个地方，写下“以和为贵”，成为进入该馆的第一个在位日本首相。\n" +
        "        除了沈阳的九一八历史博物馆外，在辽宁辽阳市的白塔公园内，还有一座九一八事变策划地纪念馆，当时被称作白塔会馆。事变前一日，本庄繁与关东军主任参谋石原莞尔和关东军高级参谋坂垣征四郎在火车站前白塔旅馆召开了事变前密谋会议。\n" +
        "防空警报\n" +
        "        9月18日被不少中国人认为是“国耻日”，而中国民间要求将9月18日订为国耻日的诉求也不时出现。沈阳从1995年始，每年在9月18日晚上鸣响防空警报3分钟，以警示民众勿忘国耻。当前，已有哈尔滨、长春、昆明、合肥、杭州、乌鲁木齐、南昌、齐齐哈尔、金华、本溪、太原、西安等百余座城市选在每年9月18日进行防空警报鸣放。"
      },
      content_5: {
        default: ""
      },
    },
    created: function () {
      var env = this.$getConfig().env;
      if (env.platform.toLocaleLowerCase() == 'web') {
        var clientWidth = document.body.clientWidth;
        var ratio = clientWidth / 750;
        this.img_w = clientWidth + "px";
        this.img_1_h = ratio * this.img_1_h + "px";
        this.img_2_h = ratio * this.img_2_h + "px";
        this.img_3_h = ratio * this.img_3_h + "px";
        this.img_4_h = ratio * this.img_4_h + "px";
        this.img_5_h = ratio * this.img_5_h + "px";
        this.contentMargin = ratio * this.contentMargin + "px";
        this.tex_size_1 = ratio * this.tex_size_1 + "px";
        this.tex_size_2 = ratio * this.tex_size_2 + "px";
        this.topMargin = ratio * this.topMargin + "px";
        this.line_height = ratio * this.line_height + "px";
      }
    },
  };
</script>